AmbiqMicro/lv_port_ambiq/lvgl_ambiq_demo/lvgl_cellular_menu/apollo510dL_evb/startup_gcc.c
    //
    // Peripheral Interrupts
    //
    am_brownout_isr,                        //  0: Brownout (rstgen)
    am_secure_watchdog_isr,                 //  1: Secure Watchdog (WDT)
    am_secure_rtc_isr,                      //  2: Secure RTC
    am_vcomp_isr,                           //  3: Voltage Comparator
    am_default_isr,                         //  4: Reserved
    am_default_isr,                         //  5: Reserved
    am_iomaster0_isr,                       //  6: I/O Master 0
    am_iomaster1_isr,                       //  7: I/O Master 1
    am_iomaster2_isr,                       //  8: I/O Master 2
    am_iomaster3_isr,                       //  9: I/O Master 3
    am_iomaster4_isr,                       // 10: I/O Master 4
    am_iomaster5_isr,                       // 11: I/O Master 5
    am_iomaster6_isr,                       // 12: I/O Master 6 (I3C/I2C/SPI)
    am_iomaster7_isr,                       // 13: I/O Master 7 (I3C/I2C/SPI)
    am_default_isr,                         // 14: Reserved
    am_uart_isr,                            // 15: UART0
    am_uart1_isr,                           // 16: UART1
    am_ipc_pend_msg_isr,                    // 17: IPC Data Pending Message
    am_ipc_err_isr,                         // 18: IPC Error
    am_adc_isr,                             // 19: ADC
    am_mspi0_isr,                           // 20: MSPI0
    am_mspi1_isr,                           // 21: MSPI1
    am_mspi2_isr,                           // 22: MSPI2
    am_clkgen_isr,                          // 23: ClkGen
    am_cryptosec_isr,                       // 24: Crypto Secure
    am_default_isr,                         // 25: Reserved
    am_sdio0_isr,                           // 26: SDIO0
    am_usb_isr,                             // 27: USB
    am_gpu_isr,                             // 28: GPU
    am_disp_isr,                            // 29: DISP
    am_dsi_isr,                             // 30: DSI
    am_watchdog_isr,                        // 31: Watchdog (WDT)
    am_secure_stimer_cmpr0_isr,             // 32: Secure System Timer Compare0
    am_secure_stimer_cmpr1_isr,             // 33: Secure System Timer Compare1
    am_secure_stimer_cmpr2_isr,             // 34: Secure System Timer Compare2
    am_secure_stimer_cmpr3_isr,             // 35: Secure System Timer Compare3
    am_secure_stimer_cmpr4_isr,             // 36: Secure System Timer Compare4
    am_secure_stimer_cmpr5_isr,             // 37: Secure System Timer Compare5
    am_secure_stimer_cmpr6_isr,             // 38: Secure System Timer Compare6
    am_secure_stimer_cmpr7_isr,             // 39: Secure System Timer Compare7
    am_secure_stimerof_isr,                 // 40: Secure System Timer Cap Overflow
    am_rtc_isr,                             // 41: RTC
    am_audadc0_isr,                         // 42: Audio ADC
    am_default_isr,                         // 43: Reserved
    am_dspi2s0_isr,                         // 44: I2S0
    am_default_isr,                         // 45: Reserved
    am_default_isr,                         // 46: Reserved
    am_default_isr,                         // 47: Reserved
    am_pdm0_isr,                            // 48: PDM0
    am_default_isr,                         // 49: Reserved
    am_default_isr,                         // 50: Reserved
    am_default_isr,                         // 51: Reserved
    am_default_isr,                         // 52: Reserved
    am_default_isr,                         // 53: Reserved
    am_default_isr,                         // 54: Reserved
    am_default_isr,                         // 55: Reserved
    am_gpio0_001f_isr,                      // 56: GPIO N0 pins  0-31
    am_gpio0_203f_isr,                      // 57: GPIO N0 pins 32-63
    am_gpio0_405f_isr,                      // 58: GPIO N0 pins 64-95
    am_gpio0_607f_isr,                      // 59: GPIO N0 pins 96-127
    am_gpio0_809f_isr,                      // 60: GPIO N0 pins 128-159
    am_gpio0_a0bf_isr,                      // 61: GPIO N0 pins 160-191
    am_gpio0_c0df_isr,                      // 62: GPIO N0 pins 192-223
    am_gpio0_e0ff_isr,                      // 63: GPIO N0 pins 224-256
    am_default_isr,                         // 64: Reserved
    am_default_isr,                         // 65: Reserved
    am_default_isr,                         // 66: Reserved
    am_secure_timer00_isr,                  // 67: Secure timer0
    am_secure_timer01_isr,                  // 68: Secure timer1
    am_secure_timer02_isr,                  // 69: Secure timer2
    am_secure_timer03_isr,                  // 70: Secure timer3
    am_secure_timer04_isr,                  // 71: Secure timer4
    am_default_isr,                         // 72: Reserved
    am_default_isr,                         // 73: Reserved
    am_default_isr,                         // 74: Reserved
    am_default_isr,                         // 75: Reserved
    am_default_isr,                         // 76: Reserved
    am_default_isr,                         // 77: Reserved
    am_default_isr,                         // 78: Reserved
    am_default_isr,                         // 79: Reserved
    am_default_isr,                         // 80: Reserved
    am_default_isr,                         // 81: Reserved
    am_default_isr,                         // 82: Reserved
    am_default_isr,                         // 83: Reserved
    am_sdio1_isr,                           // 84: SDIO1
    am_i3c0_isr,                            // 85: I3C0
    am_default_isr,                         // 86: Reserved
    am_default_isr,                         // 87: Reserved
    am_default_isr,                         // 88: Reserved
    am_default_isr,                         // 89: Reserved
    am_default_isr,                         // 90: Reserved
    am_default_isr,                         // 91: Reserved
    am_software0_isr,                       // 92: SOFTWARE0
    am_software1_isr,                       // 93: SOFTWARE1
    am_software2_isr,                       // 94: SOFTWARE2
    am_software3_isr,                       // 95: SOFTWARE3
    am_ioslave_fd0_isr,                     // 96: IOSFD0
    am_ioslave_fd0_acc_isr,                 // 97: IOSFDACC0
    am_ioslave_fd1_isr,                     // 98: IOSFD1
    am_ioslave_fd1_acc_isr,                 // 99: IOSFDACC1
    am_stimer_cmpr0_isr,                    // 100: System Timer Compare0
    am_stimer_cmpr1_isr,                    // 101: System Timer Compare1
    am_stimer_cmpr2_isr,                    // 102: System Timer Compare2
    am_stimer_cmpr3_isr,                    // 103: System Timer Compare3
    am_stimer_cmpr4_isr,                    // 104: System Timer Compare4
    am_stimer_cmpr5_isr,                    // 105: System Timer Compare5
    am_stimer_cmpr6_isr,                    // 106: System Timer Compare6
    am_stimer_cmpr7_isr,                    // 107: System Timer Compare7
    am_stimerof_isr,                        // 108: System Timer Cap Overflow
    am_timer00_isr,                         // 109: timer0
    am_timer01_isr,                         // 110: timer1
    am_timer02_isr,                         // 111: timer2
    am_timer03_isr,                         // 112: timer3
    am_timer04_isr,                         // 113: timer4
    am_timer05_isr,                         // 114: timer5
    am_timer06_isr,                         // 115: timer6
    am_timer07_isr,                         // 116: timer7
    am_timer08_isr,                         // 117: timer8
    am_timer09_isr,                         // 118: timer9
    am_timer10_isr,                         // 119: timer10
    am_timer11_isr,                         // 120: timer11
    am_timer12_isr,                         // 121: timer12
    am_timer13_isr,                         // 122: timer13
    am_timer14_isr,                         // 123: timer14
    am_timer15_isr,                         // 124: timer15
    am_gpio1_001f_isr,                      // 125: GPIO N1 pins  0-31
    am_gpio1_203f_isr,                      // 126: GPIO N1 pins 32-63
    am_gpio1_405f_isr,                      // 127: GPIO N1 pins 64-95
    am_gpio1_607f_isr,                      // 128: GPIO N1 pins 96-127
    am_gpio1_809f_isr,                      // 129: GPIO N1 pins 128-159
    am_gpio1_a0bf_isr,                      // 130: GPIO N1 pins 160-191
    am_gpio1_c0df_isr,                      // 131: GPIO N1 pins 192-223
    am_default_isr,                         // 132: Reserved
    FloatingPoint_Handler,                  // 133: Floating Point Exception
    am_otp_isr                              // 134: OTP
};

